Repository: pjaol/safeflow
Catalog: Sources/Localizable.xcstrings
Source language: en
Languages: de, es, fr

source: Your cramp days are increasing
de: Deine Krampftage nehmen zu
es: Tus días con cólicos están aumentando
fr: Vos jours de crampes augmentent

source: You've been logging heavy flow
de: Du hast starke Blutungen erfasst
es: Has registrado flujo abundante
fr: Vous avez noté des règles abondantes

source: Cramps outside your period
de: Krämpfe außerhalb deiner Periode
es: Cólicos fuera de tu período
fr: Crampes en dehors de vos règles

source: A pattern worth discussing with your doctor
de: Ein Muster, das du mit deiner Ärztin besprechen solltest
es: Un patrón que vale la pena hablar con tu médico
fr: Un schéma à discuter avec votre médecin

source: Severe symptoms most cycles
de: Starke Symptome in den meisten Zyklen
es: Síntomas graves en la mayoría de los ciclos
fr: Symptômes sévères la plupart des cycles

source: Period pain that gets worse cycle over cycle is worth mentioning to a doctor. It can have treatable causes.
de: Regelschmerzen, die von Zyklus zu Zyklus schlimmer werden, solltest du mit einer Ärztin besprechen. Es kann behandelbare Ursachen geben.
es: El dolor menstrual que empeora de ciclo en ciclo vale la pena mencionárselo a un médico. Puede tener causas tratables.
fr: Des douleurs menstruelles qui s’aggravent d’un cycle à l’autre méritent d’être signalées à un médecin. Elles peuvent avoir des causes traitables.

source: Consistently heavy periods are common but worth discussing with a doctor — especially if you’re soaking through protection quickly or feeling fatigued.
de: Durchgehend starke Perioden sind häufig, aber es lohnt sich, sie mit einer Ärztin zu besprechen — besonders wenn du Schutz schnell durchtränkst oder dich ungewöhnlich müde fühlst.
es: Los períodos abundantes de forma constante son comunes, pero vale la pena discutirlos con un médico — especialmente si empapas la protección rápidamente o te sientes inusualmente fatigada.
fr: Des règles constamment abondantes sont courantes mais méritent d’être discutées avec un médecin — surtout si vous saturez rapidement votre protection ou ressentez une fatigue inhabituelles.

source: You often log cramps during your follicular phase, not just your period. This is less typical and worth tracking — a doctor can help figure out what’s going on.
de: Du erfasst häufig Krämpfe in deiner Follikelphase, nicht nur während der Periode. Das ist weniger typisch und es lohnt sich, es zu beobachten — eine Ärztin kann helfen herauszufinden, was los ist.
es: Frecuentemente registras cólicos durante tu fase folicular, no solo durante tu período. Esto es menos típico y vale la pena seguirlo — un médico puede ayudar a entender qué está pasando.
fr: Vous notez souvent des crampes pendant votre phase folliculaire, pas seulement pendant vos règles. C’est moins courant et cela vaut la peine d’être suivi — un médecin peut vous aider à comprendre ce qui se passe.

source: You are consistently logging multiple high-intensity symptoms. This pattern is worth discussing with a doctor — there are well-understood and treatable causes.
de: Du erfasst regelmäßig mehrere starke Symptome. Dieses Muster ist es wert, mit einer Ärztin besprochen zu werden — es gibt gut verstandene und behandelbare Ursachen.
es: Estás registrando de forma constante múltiples síntomas de alta intensidad. Este patrón vale la pena discutirlo con un médico — hay causas bien conocidas y tratables.
fr: Vous enregistrez régulièrement plusieurs symptômes intenses. Ce schéma mérite d’être discuté avec un médecin — il existe des causes bien comprises et traitables.

source: Cycles shorter than 21 days are worth mentioning to a doctor — it’s a common and treatable pattern.
de: Zyklen unter 21 Tagen solltest du mit einer Ärztin besprechen — das ist ein häufiges und behandelbares Muster.
es: Los ciclos de menos de 21 días vale la pena mencionárselos a un médico — es un patrón común y tratable.
fr: Les cycles inférieurs à 21 jours méritent d’être mentionnés à un médecin — c’est un schéma courant et traitable.

source: Cycles over 35 days can have a few different causes — a doctor can help figure out what’s going on.
de: Zyklen über 35 Tage können verschiedene Ursachen haben — eine Ärztin kann helfen, das abzuklären.
es: Los ciclos de más de 35 días pueden tener varias causas — un médico puede ayudarte a entender qué está pasando.
fr: Les cycles supérieurs à 35 jours peuvent avoir plusieurs causes — un médecin peut vous aider à comprendre ce qui se passe.

source: Your cycles vary by more than a week from month to month. This is fairly common but worth a chat with a doctor if it's been going on a while.
de: Deine Zyklen schwanken von Monat zu Monat um mehr als eine Woche. Das ist recht häufig, aber nach einer Weile lohnt sich ein Gespräch mit einer Ärztin.
es: Tus ciclos varían más de una semana de un mes a otro. Esto es bastante común, pero vale la pena consultarlo con un médico si lleva tiempo ocurriendo.
fr: Vos cycles varient de plus d’une semaine d’un mois à l’autre. C’est assez courant, mais il est utile d’en parler à un médecin si cela dure depuis un moment.

source: Period pain that gets worse cycle over cycle is worth mentioning to a doctor. It can have several treatable causes.
de: Regelschmerzen, die von Zyklus zu Zyklus schlimmer werden, solltest du mit einer Ärztin besprechen. Es kann mehrere behandelbare Ursachen geben.
es: El dolor menstrual que empeora de ciclo en ciclo vale la pena mencionárselo a un médico. Puede tener varias causas tratables.
fr: Des douleurs menstruelles qui s’aggravent d’un cycle à l’autre méritent d’être signalées à un médecin. Elles peuvent avoir plusieurs causes traitables.

source: Consistently heavy periods are worth discussing with a doctor — especially if you are soaking through a pad or tampon within an hour, on multiple consecutive hours, or feeling unusually fatigued.
de: Durchgehend starke Perioden sind es wert, mit einer Ärztin besprochen zu werden — besonders wenn du Schutz innerhalb einer Stunde durchtränkst, mehrere aufeinanderfolgende Stunden lang, oder dich ungewöhnlich müde fühlst.
es: Los períodos abundantes de forma constante vale la pena discutirlos con un médico — especialmente si empapas una compresa o tampón en una hora, durante varias horas consecutivas, o si te sientes inusualmente fatigada.
fr: Des règles constamment abondantes méritent d’être discutées avec un médecin — surtout si vous saturez une protection en une heure, sur plusieurs heures consécutives, ou si vous vous sentez inhabituellement fatiguée.

source: You have been logging heavy flow
de: Du hast starke Blutungen erfasst
es: Has registrado flujo abundante
fr: Vous avez noté des règles abondantes

source: Cramps outside your period can have several causes. It's worth mentioning to a doctor who can help investigate.
de: Krämpfe außerhalb deiner Periode können verschiedene Ursachen haben. Es lohnt sich, das mit einer Ärztin zu besprechen, die helfen kann, die Ursache zu finden.
es: Los cólicos fuera de tu período pueden tener varias causas. Vale la pena mencionárselos a un médico que pueda investigarlos.
fr: Les crampes en dehors de vos règles peuvent avoir plusieurs causes. Il vaut la peine d’en parler à un médecin qui pourra les investiguer.

source: You've been logging significant mood symptoms in the days before your period across several cycles. If this pattern significantly affects your daily life, your doctor can help — there are recognised approaches that can make a real difference. The IAPMD has specialist support.
de: Du hast in mehreren Zyklen erhebliche Stimmungssymptome in den Tagen vor deiner Periode erfasst. Wenn dieses Muster deinen Alltag stark beeinträchtigt, kann deine Ärztin helfen — es gibt anerkannte Ansätze, die wirklich einen Unterschied machen können. Die IAPMD bietet Fachunterstützung.
es: Has registrado síntomas de ánimo significativos en los días anteriores a tu período durante varios ciclos. Si este patrón afecta significativamente tu vida diaria, tu médico puede ayudar — existen enfoques reconocidos que pueden marcar una gran diferencia. La IAPMD ofrece apoyo especializado.
fr: Vous avez noté des symptômes d’humeur significatifs dans les jours précédant vos règles sur plusieurs cycles. Si ce schéma affecte considérablement votre vie quotidienne, votre médecin peut vous aider — il existe des approches reconnues qui peuvent faire une vraie différence. L’IAPMD offre un soutien spécialisé.

source: Heat can help
de: Wärme kann helfen
es: El calor puede ayudar
fr: La chaleur peut aider

source: A warm compress or hot water bottle on your lower abdomen may ease cramp discomfort.
de: Eine Wärmflasche oder ein warmes Kompresse auf dem Unterbauch kann Krämpfe lindern.
es: Una compresa caliente o una bolsa de agua caliente en el abdomen inferior puede aliviar los cólicos.
fr: Une bouillotte ou une compresse chaude sur le bas-ventre peut soulager les crampes.

source: Rest is productive
de: Ruhe ist produktiv
es: El descanso es productivo
fr: Le repos est productif

source: Your body is doing real work this week. Lighter activity and extra sleep are a good call.
de: Dein Körper leistet diese Woche echte Arbeit. Leichtere Aktivität und mehr Schlaf sind eine gute Wahl.
es: Tu cuerpo está haciendo un trabajo real esta semana. Actividad más ligera y dormir más es una buena idea.
fr: Votre corps travaille vraiment cette semaine. Une activité plus légère et un peu plus de sommeil sont une bonne idée.

source: Iron-rich foods
de: Eisenreiche Lebensmittel
es: Alimentos ricos en hierro
fr: Aliments riches en fer

source: Leafy greens, lentils, and beans can help replenish iron lost during your period.
de: Blattgemüse, Linsen und Bohnen können helfen, das während der Periode verlorene Eisen zu ergänzen.
es: Las verduras de hoja verde, las lentejas y los frijoles pueden ayudar a reponer el hierro perdido durante tu período.
fr: Les légumes verts, les lentilles et les haricots peuvent aider à reconstituer le fer perdu pendant les règles.

source: Ibuprofen timing
de: Ibuprofen richtig einnehmen
es: Cuándo tomar ibuprofeno
fr: Timing de l'ibuprofène

source: Anti-inflammatory pain relief (like ibuprofen) works best taken with food at the first sign of cramps, rather than waiting.
de: Entzündungshemmende Schmerzmittel (wie Ibuprofen) wirken am besten, wenn sie beim ersten Anzeichen von Krämpfen mit einer Mahlzeit eingenommen werden, anstatt zu warten.
es: Los analgésicos antiinflamatorios (como el ibuprofeno) funcionan mejor tomados con comida al primer signo de cólicos, en lugar de esperar.
fr: Les anti-douleurs anti-inflammatoires (comme l'ibuprofène) sont plus efficaces pris avec de la nourriture aux premiers signes de crampes, plutôt que d'attendre.

source: Energy is building
de: Energie nimmt zu
es: La energía está aumentando
fr: L'énergie monte

source: Estrogen rises during this phase — many people find focus and motivation easier right now.
de: Östrogen steigt in dieser Phase — viele Menschen finden es jetzt leichter, sich zu konzentrieren und motiviert zu bleiben.
es: Los estrógenos aumentan durante esta fase — muchas personas encuentran más fácil concentrarse y mantenerse motivadas ahora.
fr: Les œstrogènes augmentent pendant cette phase — beaucoup de personnes trouvent la concentration et la motivation plus faciles en ce moment.

source: Good time for new things
de: Gute Zeit für Neues
es: Buen momento para cosas nuevas
fr: Bon moment pour de nouvelles choses

source: Starting a new project or learning something new tends to feel easier in the follicular phase.
de: Ein neues Projekt zu starten oder etwas Neues zu lernen fühlt sich in der Follikelphase oft leichter an.
es: Comenzar un nuevo proyecto o aprender algo nuevo tiende a sentirse más fácil en la fase folicular.
fr: Démarrer un nouveau projet ou apprendre quelque chose de nouveau tend à sembler plus facile pendant la phase folliculaire.

source: Movement feels easier
de: Bewegung fällt leichter
es: El movimiento se siente más fácil
fr: Le mouvement est plus facile

source: Higher estrogen supports muscle recovery, making this a good window for more intense workouts if that's your thing.
de: Höheres Östrogen unterstützt die Muskelregeneration, was diesen Zeitraum zu einem guten Fenster für intensivere Workouts macht, wenn das dein Ding ist.
es: Los niveles más altos de estrógeno apoyan la recuperación muscular, lo que hace que este sea un buen momento para entrenamientos más intensos si es lo tuyo.
fr: Un taux d'œstrogènes plus élevé soutient la récupération musculaire, ce qui en fait une bonne fenêtre pour des entraînements plus intenses si c'est votre truc.

source: Support your gut
de: Darm unterstützen
es: Cuida tu intestino
fr: Prenez soin de votre intestin

source: Fermented foods like yogurt and kimchi support the gut microbiome, which influences hormone processing.
de: Fermentierte Lebensmittel wie Joghurt und Kimchi unterstützen das Darmmikrobiom, das die Hormonverarbeitung beeinflusst.
es: Los alimentos fermentados como el yogur y el kimchi apoyan el microbioma intestinal, que influye en el procesamiento hormonal.
fr: Les aliments fermentés comme le yaourt et le kimchi soutiennent le microbiome intestinal, qui influence le traitement des hormones.

source: Peak energy window
de: Energie auf dem Höhepunkt
es: Ventana de energía máxima
fr: Pic d'énergie

source: Many people feel most social and energised around ovulation. A good time for presentations or important conversations.
de: Viele Menschen fühlen sich um den Eisprung herum am geselligsten und energiegeladensten. Ein guter Zeitpunkt für Präsentationen oder wichtige Gespräche.
es: Muchas personas se sienten más sociables y con más energía alrededor de la ovulación. Un buen momento para presentaciones o conversaciones importantes.
fr: Beaucoup de personnes se sentent plus sociables et énergiques autour de l'ovulation. Un bon moment pour des présentations ou des conversations importantes.

source: Basal temperature rises
de: Basaltemperatur steigt
es: La temperatura basal sube
fr: La température basale augmente

source: A slight rise in basal body temperature after ovulation is normal — it confirms ovulation has occurred.
de: Ein leichter Anstieg der Basaltemperatur nach dem Eisprung ist normal — er bestätigt, dass der Eisprung stattgefunden hat.
es: Un ligero aumento de la temperatura corporal basal después de la ovulación es normal — confirma que la ovulación ha ocurrido.
fr: Une légère hausse de la température corporelle basale après l'ovulation est normale — elle confirme que l'ovulation a eu lieu.

source: Stay hydrated
de: Gut hydratiert bleiben
es: Mantente hidratada
fr: Restez hydratée

source: Hormonal shifts around ovulation can increase body temperature slightly. Extra water helps.
de: Hormonelle Veränderungen rund um den Eisprung können die Körpertemperatur leicht erhöhen. Mehr Wasser hilft.
es: Los cambios hormonales alrededor de la ovulación pueden aumentar ligeramente la temperatura corporal. Beber más agua ayuda.
fr: Les changements hormonaux autour de l'ovulation peuvent légèrement augmenter la température corporelle. Boire plus d'eau aide.

source: Notice your body
de: Auf deinen Körper achten
es: Presta atención a tu cuerpo
fr: Écoutez votre corps

source: Some people feel mild one-sided pelvic discomfort around ovulation (mittelschmerz). It's common and usually brief.
de: Manche Menschen spüren um den Eisprung herum ein leichtes einseitiges Unterleibsziehen (Mittelschmerz). Das ist häufig und meist kurz.
es: Algunas personas sienten una leve molestia pélvica unilateral alrededor de la ovulación (mittelschmerz). Es común y suele ser breve.
fr: Certaines personnes ressentent une légère gêne pelvienne d'un côté autour de l'ovulation (mittelschmerz). C'est courant et généralement bref.

source: Mood may shift
de: Stimmung kann sich verändern
es: El estado de ánimo puede cambiar
fr: L'humeur peut changer

source: Progesterone rises then drops in the luteal phase. If your mood dips in the second half, that's a recognised pattern.
de: Progesteron steigt und fällt dann in der Lutealphase. Wenn deine Stimmung in der zweiten Hälfte sinkt, ist das ein bekanntes Muster.
es: La progesterona sube y luego baja en la fase lútea. Si tu estado de ánimo decae en la segunda mitad, es un patrón reconocido.
fr: La progestérone monte puis chute pendant la phase lutéale. Si votre humeur baisse dans la seconde moitié, c'est un schéma reconnu.

source: Magnesium may help
de: Magnesium kann helfen
es: El magnesio puede ayudar
fr: Le magnésium peut aider

source: Some research links magnesium intake to reduced PMS symptoms. Dark chocolate and nuts are decent sources.
de: Einige Studien zeigen, dass Magnesium PMS-Symptome lindern kann. Dunkle Schokolade und Nüsse sind gute Quellen.
es: Algunas investigaciones relacionan el consumo de magnesio con la reducción de los síntomas del SPM. El chocolate negro y los frutos secos son buenas fuentes.
fr: Certaines recherches associent la prise de magnésium à une réduction des symptômes du SPM. Le chocolat noir et les noix en sont de bonnes sources.

source: Sleep changes are normal
de: Schlafveränderungen sind normal
es: Los cambios en el sueño son normales
fr: Les changements de sommeil sont normaux

source: Progesterone can affect sleep quality in the luteal phase. Cooler room temperature and consistent sleep times help.
de: Progesteron kann die Schlafqualität in der Lutealphase beeinflussen. Eine kühlere Raumtemperatur und regelmäßige Schlafzeiten helfen.
es: La progesterona puede afectar la calidad del sueño en la fase lútea. Una temperatura ambiente más fresca y horarios de sueño regulares ayudan.
fr: La progestérone peut affecter la qualité du sommeil pendant la phase lutéale. Une température ambiante plus fraîche et des horaires de sommeil réguliers aident.

source: Reduce salt if bloated
de: Salz reduzieren bei Blähungen
es: Reduce la sal si tienes hinchazón
fr: Réduire le sel en cas de ballonnements

source: Bloating is common in the late luteal phase. Reducing salty foods and increasing water can ease it.
de: Blähungen sind in der späten Lutealphase häufig. Weniger salzige Lebensmittel und mehr Wasser können helfen.
es: La hinchazón es común en la fase lútea tardía. Reducir los alimentos salados y aumentar el agua puede aliviarla.
fr: Les ballonnements sont courants en fin de phase lutéale. Réduire les aliments salés et augmenter l'apport en eau peut les soulager.

source: Version
es: Versión

source: 1W
es: 1S
fr: 1S

source: Start
es: Inicio
fr: Début

source: PCOS
es: SOP
fr: SOPK

source: Neutral
fr: Neutre
